
grammar_a = (
    "*ПРАВИЛО СОСТАВЛЕНИЯ ПОВЕСТВОВАТЕЛЬНЫХ  И ВОПРОСИТЕЛЬНЫХ ПРЕДЛОЖЕНИЙ*\n\n"
    "_Для отрицательных и утвердительных предложений. _😊\n"
    "*Подлежащее + сказуемое + дополнение + обстоятельство.*\n"
    "I often see her at school.\n\n"
    "_Для закрытых вопросов (где ответами будут «да» или «нет»)._ 🤔\n"
    "*Вспомогательный глагол + подлежащее + смысловой глагол + обстоятельство.*\n"
    "Do you go to school every day?\n\n"
    "_Для открытых вопросов (подразумевает развернутый ответ)._💬\n"
    "*Вопросительное слово + вспомогательный глагол + подлежащее + смысловой глагол + обстоятельство (или дополнение).*\n"
    "What do you usually have for breakfast?"
)
grammar_a1 = (
    "*УПОТРЕБЛЕНИЕ ГЛАГОЛА to be* 📚\n\n"
    "*to be - быть, находится, являться.* 🏠\n По количеству форм глагол to be ― рекордсмен. Их восемь:\nbe, am, is, are, was, were, being, been.\n\n"
    "В настоящем простом времени (Present Simple) форма глагола *to be* зависит от *лица* и *числа подлежащего*. Для отрицания нужно просто добавить частицу *not* после глагола to be.\n"
    "_I - am_, (отрицательная форма - *am not*)\n"
    "I *am* at home — «Я дома»🏠; I *am not* at home — «Я не дома» \n"
    "_he, she, it - is_, (отрицательная форма - *isn't*)\n"
    "He *is* in New York — «Он находится в Нью-Йорке»🏙️; He *isn't* in New York — «Он не находится в Нью-Йорке» \n"
    "_we, you, they - are_, (отрицательная форма - *aren't*)\n"
    "We *are* the champions! – «Мы (есть) чемпионы!»🏆; We *aren't* the champions! – «Мы не чемпионы!» \n"
    "В прошедшем времени глагол *to be* принимает форму *was - с единственным числом* и *were - с множественным*. 👥\n\n"
    "Когда нужно описать определённое поведение человека в *данный момент* используется *being*.\n"
    "Примеры: He's *being lazy* — Он ленится 😌\n\n"
    "Глагол *been* употребляется, когда необходимо выразить действие или состояние, которое произошло в прошлом и имеет отношение к настоящему времени. 🕰️"
)

grammar_a2 = (
    
)

grammar_b1 = (
    "*СПОСОБЫ ВЫРАЖЕНИЯ БУДУЩЕГО ВРЕМЕНИ В АНГЛИЙСКОМ ЯЗЫКЕ.* 🕒\n\n"
    "_Future Simple_ 🔮\nПрименяется, когда нужно рассказать о будущих фактах, сделать прогнозы или выразить своё мнение. \nОбразуется по схеме: *действующее лицо + will + действие*\n\n"
    "_Future Continuous_ 🕒\nИспользуется, когда нужно описать процесс, который будет длиться в будущем. \nСхема образования: *действующее лицо + will be + действие с окончанием -ing.*\n\n"
    "_Конструкция to be going to_ 📅\n Переводится как «собираться что-либо сделать». Применяется, когда нужно выразить намерения или рассказать о планах.\nСхема образования: *подлежащее + to be + going to + глагол.*\n\n"
    "_Present Simple_ ⏳\n Используется, когда речь идёт о чётком расписании или графике. Также это время выражает будущее, если использовать его после союзов *when, as soon as, before, after и until.*\nСхема образования: *действующее лицо + действие в первой форме глагола или с окончанием 's'*\n\n "
    "_Present Continuous_ 🕰️\n Применяется, когда нужно рассказать о действии, которое уже было спланировано и организовано заранее. Как правило, в этом случае в предложении указывают время или дату, когда оно произойдёт.\nСхема образования: *действующее лицо + to be + действие с окончанием -ing.*\n\n"
)
grammar_b2 = (
    "*ПРИЧАСТИЕ (PARTICIPLE) В АНГЛИЙСКОМ ЯЗЫКЕ* 📚\n\n"
    "Существует два основных типа причастий:\n\n"
    "*Present Participle (Причастие I)* — причастие настоящего времени. ⏳\n"
    "_Образуется добавлением окончания -ing к базовой форме глагола._\n"
    "Например: to work → working (работающий), 🏢\n"
    "to speak → speaking (говорящий), 🗣️\n"
    "to read → reading (читающий). 📖\n\n"
    "*Past Participle (Причастие II)* — причастие прошедшего времени. 🕰️\n"
    "_Для правильных глаголов образуется добавлением окончания -ed к базовой форме глагола, а для неправильных — имеет особые формы._\n"
    "Например: to work → worked (сделанный), ✅\n"
    "to speak → spoken (сказанный), 🗣️\n"
    "to read → read (прочитанный). 📖\n\n"
    "*Некоторые правила написания Present Participle:* 📝\n"
    "Если односложный глагол заканчивается на согласную с предшествующей краткой гласной, согласная удваивается: sit → sitting, run → running. 🏃‍♂️\n"
    "Если глагол заканчивается на -e, эта буква опускается: write → writing, come → coming. 📝\n"
    "Если глагол заканчивается на -ie, эти буквы меняются на -y: lie → lying, die → dying. 😌"
)
grammar_c1 = (
    "*ПАССИВНЫЙ ЗАЛОГ (PASSIVE VOICE) В АНГЛИЙСКОМ ЯЗЫКЕ* 📚\n"
    "Используется, когда в речи не указывается, кто совершает действие. В таких предложениях главный акцент всегда на самом действии. 🔍\n\n"
    "*Общее правило построения пассивного залога:* 📝\n"
    "Поставить предмет или человека, над которым совершается действие, на первое место в предложении. 👥\n"
    "Например: A letter… (письмо) 📧, A car… (машина) 🚗, Children… (дети) 👶.\n\n"
    "На второе место поставить глагол to be в нужном времени. ⏳\n"
    "Например: Present Simple (простое настоящее время) — am, are, is 🕒\n"
    "Past Simple (простое прошедшее время) — was, were 🕰️\n"
    "Future Simple (простое будущее время) — will be 🔮\n\n"
    "Само действие (глагол), которое совершено над действующим лицом, поставить в прошедшее время. 📝\n"
    "Если глагол правильный, добавить окончание -ed (prepare — prepared) ✅, если неправильный — поставить в 3-ю форму (send — sent) 📦"
)
grammar_c2 = (
    "СОГЛАСОВАНИЕ ВРЕМЁН В АНГЛИЙСКОМ ЯЗЫКЕ 📚\n\n"
    "Согласование времён в английском языке — это зависимость времени в одной части предложения от времени в другой части. ⏳\n"
    "*Основное правило:* если главная часть сложноподчинённого предложения находится в прошедшем времени, то и придаточная часть должна быть в прошедшем времени. 🔄\n\n"
    "*Три основных варианта согласования времён:* 🔢\n"
    "_Если действие в придаточном предложении происходит одновременно с действием в главном предложении, то нужно использовать_ *Past Simple* или *Past Continuous.* ⏱️\n"
    "*Пример:* They told us, “We are going to the library.” — Они сказали нам: «Мы идём в библиотеку». 📚\n"
    "They told us they *were going* to the library — Они сказали нам, что идут в библиотеку. 📚\n\n"
    "_Если действие в придаточном предложении предшествует действию в главном предложении, то глагол в придаточном используется в_ *Past Perfect* или *Past Perfect Continuous.* ⏳\n"
    "*Пример:* We were told, “It was raining a lot.” — Нам сказали: «Было много дождей». 🌧️\n"
    "We were told that it *had been raining* a lot — Нам сказали, что было много дождей. 🌧️\n\n"
    "_Если действие в придаточном предложении следует после действия в главном, то нужно использовать одно из времён_ *Future-in-the-Past.* 🔮\n"
    "*Пример:* She said: “I will try to get the highest mark on the exam.” — Она сказала: «Я постараюсь заработать на экзамене лучшую оценку». 📝\n"
    "She said she *would try* to get the highest mark on the exam — Она сказала, что постарается заработать на экзамене лучшую оценку. 📝\n\n"
    "Если в главной части глагол используется в *настоящем* или *будущем времени, то согласование не нужно.* ✅"
)